; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_17)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - person
	)

  (:init
		(= (x b0) 7)
(= (y b0) 0)
(= (x b1) 4)
(= (y b1) 0)
(= (x b2) 7)
(= (y b2) 0)
(= (x b3) -10)
(= (y b3) 0)
(= (x b4) 5)
(= (y b4) 0)
(= (x b5) -8)
(= (y b5) 0)
(= (x b6) -10)
(= (y b6) 0)
(= (x b7) -8)
(= (y b7) 0)
(= (x b8) 10)
(= (y b8) 0)
(= (x b9) -10)
(= (y b9) 0)

		(= (d p0) 0)
(= (d p1) 55)
(= (d p2) 7)
(= (d p3) 51)
(= (d p4) 24)
(= (d p5) 94)
(= (d p6) 9)
(= (d p7) 38)
(= (d p8) 84)
(= (d p9) 2)
(= (d p10) 13)
(= (d p11) 41)
(= (d p12) 59)
(= (d p13) 79)
(= (d p14) 4)
(= (d p15) 69)
(= (d p16) 23)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
		)
	)
)

; plan
1. (go_north_west b1)
   changed: (x b1) from 4 to 2.5, (y b1) from 0 to 1.5
   goals met: 0 of 17
2. (go_north_west b1)
   changed: (x b1) from 2.5 to 1, (y b1) from 1.5 to 3
   goals met: 0 of 17
3. (save_person b1 p0)
   added: (saved p0)
   goals met: 1 of 17
4. (save_person b1 p9)
   added: (saved p9)
   goals met: 2 of 17
5. (go_north_east b1)
   changed: (x b1) from 1 to 2.5, (y b1) from 3 to 4.5
   goals met: 2 of 17
6. (go_north_east b1)
   changed: (x b1) from 2.5 to 4, (y b1) from 4.5 to 6
   goals met: 2 of 17
7. (go_north_east b1)
   changed: (x b1) from 4 to 5.5, (y b1) from 6 to 7.5
   goals met: 2 of 17
8. (go_north_east b1)
   changed: (x b1) from 5.5 to 7, (y b1) from 7.5 to 9
   goals met: 2 of 17
9. (go_north_east b1)
   changed: (x b1) from 7 to 8.5, (y b1) from 9 to 10.5
   goals met: 2 of 17
10. (go_north_east b1)
   changed: (x b1) from 8.5 to 10, (y b1) from 10.5 to 12
   goals met: 2 of 17
11. (go_north_east b1)
   changed: (x b1) from 10 to 11.5, (y b1) from 12 to 13.5
   goals met: 2 of 17
12. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 13.5 to 15
   goals met: 2 of 17
13. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 15 to 16.5
   goals met: 2 of 17
14. (go_north_east b1)
   changed: (x b1) from 14.5 to 16, (y b1) from 16.5 to 18
   goals met: 2 of 17
15. (go_north_east b1)
   changed: (x b1) from 16 to 17.5, (y b1) from 18 to 19.5
   goals met: 2 of 17
16. (go_north_east b1)
   changed: (x b1) from 17.5 to 19, (y b1) from 19.5 to 21
   goals met: 2 of 17
17. (go_west b1)
   changed: (x b1) from 19 to 16
   goals met: 2 of 17
18. (go_north_west b1)
   changed: (x b1) from 16 to 14.5, (y b1) from 21 to 22.5
   goals met: 2 of 17
19. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 22.5 to 24
   goals met: 2 of 17
20. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 24 to 25.5
   goals met: 2 of 17
21. (go_west b1)
   changed: (x b1) from 11.5 to 8.5
   goals met: 2 of 17
22. (go_west b1)
   changed: (x b1) from 8.5 to 5.5
   goals met: 2 of 17
23. (go_west b1)
   changed: (x b1) from 5.5 to 2.5
   goals met: 2 of 17
24. (save_person b1 p2)
   added: (saved p2)
   goals met: 3 of 17
25. (save_person b1 p6)
   added: (saved p6)
   goals met: 4 of 17
26. (save_person b1 p10)
   added: (saved p10)
   goals met: 5 of 17
27. (save_person b1 p14)
   added: (saved p14)
   goals met: 6 of 17
28. (go_north_east b1)
   changed: (x b1) from 2.5 to 4, (y b1) from 25.5 to 27
   goals met: 6 of 17
29. (go_north_east b1)
   changed: (x b1) from 4 to 5.5, (y b1) from 27 to 28.5
   goals met: 6 of 17
30. (go_north_east b1)
   changed: (x b1) from 5.5 to 7, (y b1) from 28.5 to 30
   goals met: 6 of 17
31. (go_north_east b1)
   changed: (x b1) from 7 to 8.5, (y b1) from 30 to 31.5
   goals met: 6 of 17
32. (save_person b1 p16)
   added: (saved p16)
   goals met: 7 of 17
33. (go_north_east b1)
   changed: (x b1) from 8.5 to 10, (y b1) from 31.5 to 33
   goals met: 7 of 17
34. (go_north_east b1)
   changed: (x b1) from 10 to 11.5, (y b1) from 33 to 34.5
   goals met: 7 of 17
35. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 34.5 to 36
   goals met: 7 of 17
36. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 36 to 37.5
   goals met: 7 of 17
37. (go_west b1)
   changed: (x b1) from 14.5 to 11.5
   goals met: 7 of 17
38. (save_person b1 p4)
   added: (saved p4)
   goals met: 8 of 17
39. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 37.5 to 39
   goals met: 8 of 17
40. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 39 to 40.5
   goals met: 8 of 17
41. (go_north_east b1)
   changed: (x b1) from 14.5 to 16, (y b1) from 40.5 to 42
   goals met: 8 of 17
42. (go_north_east b1)
   changed: (x b1) from 16 to 17.5, (y b1) from 42 to 43.5
   goals met: 8 of 17
43. (go_north_west b1)
   changed: (x b1) from 17.5 to 16, (y b1) from 43.5 to 45
   goals met: 8 of 17
44. (go_north_west b1)
   changed: (x b1) from 16 to 14.5, (y b1) from 45 to 46.5
   goals met: 8 of 17
45. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 46.5 to 48
   goals met: 8 of 17
46. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 48 to 49.5
   goals met: 8 of 17
47. (save_person b1 p7)
   added: (saved p7)
   goals met: 9 of 17
48. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 49.5 to 51
   goals met: 9 of 17
49. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 51 to 52.5
   goals met: 9 of 17
50. (go_north_east b1)
   changed: (x b1) from 14.5 to 16, (y b1) from 52.5 to 54
   goals met: 9 of 17
51. (go_north_west b1)
   changed: (x b1) from 16 to 14.5, (y b1) from 54 to 55.5
   goals met: 9 of 17
52. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 55.5 to 57
   goals met: 9 of 17
53. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 57 to 58.5
   goals met: 9 of 17
54. (go_north_west b1)
   changed: (x b1) from 11.5 to 10, (y b1) from 58.5 to 60
   goals met: 9 of 17
55. (go_north_west b1)
   changed: (x b1) from 10 to 8.5, (y b1) from 60 to 61.5
   goals met: 9 of 17
56. (save_person b1 p3)
   added: (saved p3)
   goals met: 10 of 17
57. (go_north_west b1)
   changed: (x b1) from 8.5 to 7, (y b1) from 61.5 to 63
   goals met: 10 of 17
58. (save_person b1 p1)
   added: (saved p1)
   goals met: 11 of 17
59. (go_north_west b1)
   changed: (x b1) from 7 to 5.5, (y b1) from 63 to 64.5
   goals met: 11 of 17
60. (save_person b1 p12)
   added: (saved p12)
   goals met: 12 of 17
61. (go_north_west b1)
   changed: (x b1) from 5.5 to 4, (y b1) from 64.5 to 66
   goals met: 12 of 17
62. (go_north_west b1)
   changed: (x b1) from 4 to 2.5, (y b1) from 66 to 67.5
   goals met: 12 of 17
63. (go_north_east b1)
   changed: (x b1) from 2.5 to 4, (y b1) from 67.5 to 69
   goals met: 12 of 17
64. (go_north_east b1)
   changed: (x b1) from 4 to 5.5, (y b1) from 69 to 70.5
   goals met: 12 of 17
65. (go_north_east b1)
   changed: (x b1) from 5.5 to 7, (y b1) from 70.5 to 72
   goals met: 12 of 17
66. (go_north_east b1)
   changed: (x b1) from 7 to 8.5, (y b1) from 72 to 73.5
   goals met: 12 of 17
67. (go_north_east b1)
   changed: (x b1) from 8.5 to 10, (y b1) from 73.5 to 75
   goals met: 12 of 17
68. (go_north_east b1)
   changed: (x b1) from 10 to 11.5, (y b1) from 75 to 76.5
   goals met: 12 of 17
69. (go_north_east b1)
   changed: (x b1) from 11.5 to 13, (y b1) from 76.5 to 78
   goals met: 12 of 17
70. (go_north_east b1)
   changed: (x b1) from 13 to 14.5, (y b1) from 78 to 79.5
   goals met: 12 of 17
71. (go_north_west b1)
   changed: (x b1) from 14.5 to 13, (y b1) from 79.5 to 81
   goals met: 12 of 17
72. (go_north_west b1)
   changed: (x b1) from 13 to 11.5, (y b1) from 81 to 82.5
   goals met: 12 of 17
73. (save_person b1 p15)
   added: (saved p15)
   goals met: 13 of 17
74. (go_north_west b1)
   changed: (x b1) from 11.5 to 10, (y b1) from 82.5 to 84
   goals met: 13 of 17
75. (go_north_west b1)
   changed: (x b1) from 10 to 8.5, (y b1) from 84 to 85.5
   goals met: 13 of 17
76. (go_north_west b1)
   changed: (x b1) from 8.5 to 7, (y b1) from 85.5 to 87
   goals met: 13 of 17
77. (save_person b1 p13)
   added: (saved p13)
   goals met: 14 of 17
78. (go_north_west b1)
   changed: (x b1) from 7 to 5.5, (y b1) from 87 to 88.5
   goals met: 14 of 17
79. (go_north_west b1)
   changed: (x b1) from 5.5 to 4, (y b1) from 88.5 to 90
   goals met: 14 of 17
80. (save_person b1 p8)
   added: (saved p8)
   goals met: 15 of 17
81. (go_south_west b1)
   changed: (x b1) from 4 to 6, (y b1) from 90 to 88
   goals met: 15 of 17
82. (go_west b1)
   changed: (x b1) from 6 to 3
   goals met: 15 of 17
83. (go_west b1)
   changed: (x b1) from 3 to 0
   goals met: 15 of 17
84. (go_west b1)
   changed: (x b1) from 0 to -3
   goals met: 15 of 17
85. (go_west b1)
   changed: (x b1) from -3 to -6
   goals met: 15 of 17
86. (go_north_east b1)
   changed: (x b1) from -6 to -4.5, (y b1) from 88 to 89.5
   goals met: 15 of 17
87. (go_north_east b1)
   changed: (x b1) from -4.5 to -3, (y b1) from 89.5 to 91
   goals met: 15 of 17
88. (go_north_east b1)
   changed: (x b1) from -3 to -1.5, (y b1) from 91 to 92.5
   goals met: 15 of 17
89. (go_north_east b1)
   changed: (x b1) from -1.5 to 0, (y b1) from 92.5 to 94
   goals met: 15 of 17
90. (save_person b1 p5)
   added: (saved p5)
   goals met: 16 of 17
91. (go_south_east b1)
   changed: (x b1) from 0 to -2, (y b1) from 94 to 92
   goals met: 16 of 17
92. (go_south_east b1)
   changed: (x b1) from -2 to -4, (y b1) from 92 to 90
   goals met: 16 of 17
93. (go_south_east b1)
   changed: (x b1) from -4 to -6, (y b1) from 90 to 88
   goals met: 16 of 17
94. (go_south_east b1)
   changed: (x b1) from -6 to -8, (y b1) from 88 to 86
   goals met: 16 of 17
95. (go_south_east b1)
   changed: (x b1) from -8 to -10, (y b1) from 86 to 84
   goals met: 16 of 17
96. (go_south_east b1)
   changed: (x b1) from -10 to -12, (y b1) from 84 to 82
   goals met: 16 of 17
97. (go_south_east b1)
   changed: (x b1) from -12 to -14, (y b1) from 82 to 80
   goals met: 16 of 17
98. (go_south_west b1)
   changed: (x b1) from -14 to -12, (y b1) from 80 to 78
   goals met: 16 of 17
99. (go_south_west b1)
   changed: (x b1) from -12 to -10, (y b1) from 78 to 76
   goals met: 16 of 17
100. (go_south_west b1)
   changed: (x b1) from -10 to -8, (y b1) from 76 to 74
   goals met: 16 of 17
101. (go_south_west b1)
   changed: (x b1) from -8 to -6, (y b1) from 74 to 72
   goals met: 16 of 17
102. (go_south_west b1)
   changed: (x b1) from -6 to -4, (y b1) from 72 to 70
   goals met: 16 of 17
103. (go_south_west b1)
   changed: (x b1) from -4 to -2, (y b1) from 70 to 68
   goals met: 16 of 17
104. (go_south_west b1)
   changed: (x b1) from -2 to 0, (y b1) from 68 to 66
   goals met: 16 of 17
105. (save_person b1 p11)
   added: (saved p11)
   goals met: 17 of 17
